uhnp/src/Enums/ВидыСоглашений/ВидыСоглашений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСоглашений</name>
  <enumValues>
    <name>РамочныйДоговор</name>
  </enumValues>
  <enumValues>
    <name>ДоговорСУсловием</name>
  </enumValues>
  <enumValues>
    <name>Спецификация</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ВидыСвязейОбъектов/ВидыСвязейОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыСвязейОбъектов</name>
  <predefined>
    <items>
      <name>ВнутригрупповойДоговор</name>
      <description>Внутригрупповой договор</description>
    </items>
    <items>
      <name>ДоговорНаПокупкуВалюты</name>
      <description>Договор на покупку валюты</description>
    </items>
    <items>
      <name>ОбеспечениеВыданное</name>
      <description>Обеспечение выданное</description>
    </items>
    <items>
      <name>ОбеспечениеПолученное</name>
      <description>Обеспечение полученное</description>
    </items>
    <items>
      <name>Спецификация</name>
      <description>Спецификация</description>
    </items>
    <items>
      <name>Страхование</name>
      <description>Страхование</description>
    </items>
    <items>
      <name>Субподряд</name>
      <description>Субподряд</description>
    </items>
    <items>
      <name>ЦеннаяБумагаПоДоговору</name>
      <description>Ценная бумага по договору</description>
    </items>
  </predefined>
  <attributes>
    <name>ОдинаковаяОрганизация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОдинаковыйКонтрагент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОдинаковаяВалюта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОдинаковаяСумма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Внутригрупповой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоОдин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйРасходПоБазовомуДоговору</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/CommonModules/СвязанныеДоговорыУХВстраивание/Module.bsl
#Область ПрограммныйИнтерфейс
Процедура УстановитьПараметрыВыбораФормаЗаписи(Запись, ПараметрыВыбораДоговора) Экспорт

	Если Запись.ВидСвязи = Справочники.ВидыСвязейОбъектов.Страхование Тогда
		ПараметрыВыбораДоговора.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговораУХ", Справочники.ВидыДоговоровКонтрагентовУХ.Страхование));
	ИначеЕсли Запись.ВидСвязи = Справочники.ВидыСвязейОбъектов.Спецификация Тогда
		ПараметрыВыбораДоговора.Добавить(Новый ПараметрВыбора("Отбор.БазовыйДоговор", Запись.БазовыйДоговор));
		ПараметрыВыбораДоговора.Добавить(Новый ПараметрВыбора("Отбор.ВидСоглашения", Перечисления.ВидыСоглашений.Спецификация));
	ИначеЕсли Запись.ВидСвязи = Справочники.ВидыСвязейОбъектов.ОбеспечениеВыданное Тогда
		ВидыДоговоров = Новый Массив;
		ВидыДоговоров.Добавить(Справочники.ВидыДоговоровКонтрагентовУХ.ЗалогиИПоручительстваИсходящие);
		ВидыДоговоров.Добавить(Справочники.ВидыДоговоровКонтрагентовУХ.АккредитивВыданный);
		ВидыДоговоров.Добавить(Справочники.ВидыДоговоровКонтрагентовУХ.ГарантияВыданная);
		
		ПараметрыВыбораДоговора.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговораУХ", Новый ФиксированныйМассив(ВидыДоговоров)));

	ИначеЕсли Запись.ВидСвязи = Справочники.ВидыСвязейОбъектов.ОбеспечениеПолученное Тогда
		ВидыДоговоров = Новый Массив;
		ВидыДоговоров.Добавить(Справочники.ВидыДоговоровКонтрагентовУХ.ЗалогиИПоручительстваВходящие);
		ВидыДоговоров.Добавить(Справочники.ВидыДоговоровКонтрагентовУХ.ГарантияПолученная);
		
		ПараметрыВыбораДоговора.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговораУХ", Новый ФиксированныйМассив(ВидыДоговоров)));

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
